web/application/files/fedex/wsdl/ShipService_v12/ProcessShipmentRequest_Intl_Return.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
   <SOAP-ENV:Body>
      <ProcessShipmentRequest xmlns="http://fedex.com/ws/ship/v12">
         <WebAuthenticationDetail>
            <UserCredential>
               <Key>p7sPy4Sctm7XZ8gx</Key>
               <Password/>
            </UserCredential>
         </WebAuthenticationDetail>
         <ClientDetail>
            <AccountNumber>150067600</AccountNumber>
            <MeterNumber>1036920</MeterNumber>
         </ClientDetail>
         <TransactionDetail>
            <CustomerTransactionId>TC1_01_USCA_IP_w/oRETURN</CustomerTransactionId>
         </TransactionDetail>
         <Version>
            <ServiceId>ship</ServiceId>
            <Major>12</Major>
            <Intermediate>1</Intermediate>
            <Minor>0</Minor>
         </Version>
         <RequestedShipment>
            <ShipTimestamp>2012-05-03T09:30:47-05:00</ShipTimestamp>
            <DropoffType>REGULAR_PICKUP</DropoffType>
            <ServiceType>INTERNATIONAL_PRIORITY</ServiceType>
            <PackagingType>YOUR_PACKAGING</PackagingType>
            <Shipper>
               <Contact>
                  <PersonName>Chinmay</PersonName>
                  <CompanyName>Fedex</CompanyName>
                  <PhoneNumber>1234567890</PhoneNumber>
               </Contact>
               <Address>
                  <StreetLines>Recipient ADDRESS LINE 1</StreetLines>
                  <City>HAMBURG</City>
                  <StateOrProvinceCode>HH</StateOrProvinceCode>
                  <PostalCode>22415</PostalCode>
                  <CountryCode>DE</CountryCode>
                  <Residential>0</Residential>
               </Address>
            </Shipper>
            <Recipient>
               <Contact>
                  <PersonName>Shriyash</PersonName>
                  <CompanyName>Syntel</CompanyName>
                  <PhoneNumber>9876543210</PhoneNumber>
               </Contact>
               <Address>
                  <StreetLines>SHIPPER ADDRESS LINE 1</StreetLines>
                  <City>NASHVILLE</City>
                  <StateOrProvinceCode>TN</StateOrProvinceCode>
                  <PostalCode>37203</PostalCode>
                  <CountryCode>US</CountryCode>
                  <Residential>0</Residential>
               </Address>
            </Recipient>
            <ShippingChargesPayment>
               <PaymentType>SENDER</PaymentType>
               <Payor>
                  <ResponsibleParty>
                     <AccountNumber>150067600</AccountNumber>
                     <Contact>
                        <PersonName>Chinmay</PersonName>
                        <CompanyName>Fedex</CompanyName>
                        <PhoneNumber>1234567890</PhoneNumber>
                     </Contact>
                     <Address>
                        <StreetLines>Recipient ADDRESS LINE 1</StreetLines>
                        <City>HAMBURG</City>
                        <StateOrProvinceCode>HH</StateOrProvinceCode>
                        <PostalCode>22415</PostalCode>
                        <CountryCode>DE</CountryCode>
                        <Residential>0</Residential>
                     </Address>
                  </ResponsibleParty>
               </Payor>
            </ShippingChargesPayment>
            <SpecialServicesRequested>
               <SpecialServiceTypes>RETURNS_CLEARANCE</SpecialServiceTypes>
            </SpecialServicesRequested>
            <CustomsClearanceDetail>
               <CustomsOptions>
                  <Type>TRIAL</Type>
               </CustomsOptions>
               <ImporterOfRecord>
                  <AccountNumber>150067600</AccountNumber>
                  <Contact>
                     <PersonName>Chinmay</PersonName>
                     <CompanyName>Fedex</CompanyName>
                     <PhoneNumber>1234567890</PhoneNumber>
                  </Contact>
                  <Address>
                     <StreetLines>Recipient ADDRESS LINE 1</StreetLines>
                     <City>HAMBURG</City>
                     <StateOrProvinceCode>HH</StateOrProvinceCode>
                     <PostalCode>22415</PostalCode>
                     <CountryCode>DE</CountryCode>
                     <Residential>0</Residential>
                  </Address>
               </ImporterOfRecord>
               <RecipientCustomsId>
                  <Type>COMPANY</Type>
                  <Value>STRING</Value>
               </RecipientCustomsId>
               <DutiesPayment>
                  <PaymentType>SENDER</PaymentType>
                  <Payor>
                     <ResponsibleParty>
                        <AccountNumber>150067600</AccountNumber>
                        <Contact>
                           <ContactId>CK1234</ContactId>
                           <PersonName>Chinmay</PersonName>
                           <CompanyName>Fedex</CompanyName>
                           <PhoneNumber>1234567890</PhoneNumber>
                        </Contact>
                        <Address>
                           <StreetLines>Recipient ADDRESS LINE 1</StreetLines>
                           <City>HAMBURG</City>
                           <StateOrProvinceCode>HH</StateOrProvinceCode>
                           <PostalCode>22415</PostalCode>
                           <CountryCode>DE</CountryCode>
                           <Residential>0</Residential>
                        </Address>
                     </ResponsibleParty>
                  </Payor>
               </DutiesPayment>
               <CustomsValue>
                  <Currency>USD</Currency>
                  <Amount>100.0</Amount>
               </CustomsValue>
               <InsuranceCharges>
                  <Currency>USD</Currency>
                  <Amount>100.0</Amount>
               </InsuranceCharges>
               <CommercialInvoice>
                  <Comments>vhdhjschscvhscvhscvs</Comments>
                  <SpecialInstructions>string</SpecialInstructions>
                  <DeclarationStatement>string</DeclarationStatement>
                  <PaymentTerms>string</PaymentTerms>
                  <Purpose>REPAIR_AND_RETURN</Purpose>
                  <OriginatorName>string</OriginatorName>
                  <TermsOfSale>FOB_OR_FCA</TermsOfSale>
               </CommercialInvoice>
               <Commodities>
                  <Name>string</Name>
                  <NumberOfPieces>1</NumberOfPieces>
                  <Description>string</Description>
                  <CountryOfManufacture>US</CountryOfManufacture>
                  <Weight>
                     <Units>LB</Units>
                     <Value>10.0</Value>
                  </Weight>
                  <Quantity>1</Quantity>
                  <QuantityUnits>HZ</QuantityUnits>
                  <UnitPrice>
                     <Currency>USD</Currency>
                     <Amount>100.0</Amount>
                  </UnitPrice>
                  <CustomsValue>
                     <Currency>USD</Currency>
                     <Amount>100.0</Amount>
                  </CustomsValue>
               </Commodities>
            </CustomsClearanceDetail>
            <LabelSpecification>
               <LabelFormatType>COMMON2D</LabelFormatType>
               <ImageType>PNG</ImageType>
               <LabelStockType>PAPER_4X6</LabelStockType>
            </LabelSpecification>
            <RateRequestTypes>ACCOUNT</RateRequestTypes>
            <PackageCount>1</PackageCount>
            <RequestedPackageLineItems>
               <SequenceNumber>1</SequenceNumber>
               <GroupNumber>1</GroupNumber>
               <GroupPackageCount>1</GroupPackageCount>
               <InsuredValue>
                  <Currency>USD</Currency>
                  <Amount>100.0</Amount>
               </InsuredValue>
               <Weight>
                  <Units>LB</Units>
                  <Value>50.0</Value>
               </Weight>
               <Dimensions>
                  <Length>10</Length>
                  <Width>10</Width>
                  <Height>10</Height>
                  <Units>IN</Units>
               </Dimensions>
               <CustomerReferences>
                  <CustomerReferenceType>INVOICE_NUMBER</CustomerReferenceType>
                  <Value>VSVSDVYTYNVN</Value>
               </CustomerReferences>
            </RequestedPackageLineItems>
         </RequestedShipment>
      </ProcessShipmentRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
